FI/Kertomustiedot/Integraatiopalvelu_Kertomustiedot_Esimerkkisanoma_GetServiceEventData_GetServiceEventData_Request_3.0.0

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lif="Lifecare.Integration.EPRDocumentService" xmlns:lif1="Lifecare.Integration.Common.Contracts" xmlns:lif2="Lifecare.Integration.EPRDocumentService.Contracts">
   <soapenv:Header/>
   <soapenv:Body>
      <lif:GetServiceEventData_Request>
         <lif:MessageHeader>
            <lif1:MessageID/>
            <lif1:TransactionID/>
            <lif1:SenderID/>
            <lif1:SenderApplication/>
            <lif1:ReceiverID/>
            <lif1:ReceiverApplication/>
            <lif1:CharacterSet/>
            <lif1:DataServiceURL/>
            <lif1:UserLanguageCode/>
            <lif1:VersionNumber/>
         </lif:MessageHeader>
         <lif:Common>
            <lif1:ContractKey>yyy</lif1:ContractKey>
            <lif1:CallingSystem>xxx</lif1:CallingSystem>
            <lif1:Area/>
            <lif1:UserIdentifiers>
               <lif1:UserIdentifier>
                  <lif1:UserIdentifierCodeId>EFFICA_USER_ID</lif1:UserIdentifierCodeId>
                  <lif1:UserIdentifierCode>diibadaaba</lif1:UserIdentifierCode>
                  <lif1:FamilyName/>
                  <lif1:GivenNames/>
                  <lif1:Profession/>
               </lif1:UserIdentifier>
            </lif1:UserIdentifiers>
            <lif1:Function/>
            <lif1:ReasonCode/>
         </lif:Common>
         <lif:ServiceEventReq>
            <lif2:Organisation>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId></lif1:CodeSetId>
               <lif1:CodeValue>317</lif1:CodeValue>
               <lif1:CodeDescription/>
            </lif2:Organisation>
            <lif2:Area>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>2103Y</lif1:CodeValue>
               <lif1:CodeDescription/>
            </lif2:Area>
            <lif2:Function>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>esh</lif1:CodeValue>
               <lif1:CodeDescription/>
            </lif2:Function>                        
            <lif2:PatientId>
               <lif2:Identifier>010101-0101</lif2:Identifier>
            </lif2:PatientId>
            <lif2:RegisterType>
               <lif1:CodeSetName/>
               <lif1:CodeSetId/>
               <lif1:CodeValue>2</lif1:CodeValue>
               <lif1:CodeDescription/>
            </lif2:RegisterType>
         </lif:ServiceEventReq>
      </lif:GetServiceEventData_Request>
   </soapenv:Body>
</soapenv:Envelope>